package Day1;
/*
Вывести на экран слово “JAVA”, в столбик, чтобы оно повторилось 10 раз,
используя цикл на ваше усмотрение (for или while).
 */
public class Task3 {
    public static void main (String[] args){

        int javaString;

        for (javaString=0; javaString<10; javaString++){
            System.out.print ("JAVA \n");
        }

    }

}
